---
kind: method
id: M:Autodesk.Revit.DB.IFC.HostObjectSubcomponentInfo.Dispose
source: html/dfb02aa3-e1c7-9ed7-ca5e-ab18372359f8.htm
---
# Autodesk.Revit.DB.IFC.HostObjectSubcomponentInfo.Dispose Method

Releases all resources used by the HostObjectSubcomponentInfo

## Syntax (C#)
```csharp
public void Dispose()
```